<?php

$voucher_type = ["круиз" => [2000, "На большом теплоходе  ..."],
    "сафари" => [3000, "В жаркой пустыне ..."],
    "гастротур" => [1000, "Этнические рестораны ..."]];

$meal_type = ["завтрак" => [10, "с 8-00 до 10-00"],
    "ужин" => [20, "с 19-00 до 22-00"],
    "пансион" => [50, "добавляется обед с 13-00 до 15-00"]];

$countries = [
    "круиз" => [["Италия", 200], ["Хорватия", 100], ["Швеция", 300]],
    "сафари" => [["Кения", 500], ["Марокко", 300], ["ЮАР", 800]],
    "гастротур" => [["Дания", 50], ["Норвегия", 100], ["Франция", 80]]
];

$services = [
    "круиз" => [["Сауна", 50], ["Бассейн", 100], ["Бар", 200]],
    "сафари" => [["Кормление животных", 100], ["Фотоохота", 50], ["Разделывание туши", 200]],
    "гастротур" => [["Местный рынок", 50], ["Приготовление еды", 200], ["Виноферма", 100]]
];


if (isset($_COOKIE["auth_cookie"])) {
    if (isset($_POST["next"])) {
        $service_data = $services[explode("#", $_POST["type"])[0]];
        for ($i = 0; $i < count($service_data); $i++) {
            echo '<input type="checkbox" form="bill-form" name="checkbox[]" ' . ' value="' . $service_data[$i][0]  . "#".$service_data[$i][1]. '">' . $service_data[$i][0] . ". К стоимости +" . $service_data[$i][1] . '<br>';
        }
    }
}
else
{
    echo "<h1>Для просмотра необходимо авторизоваться<h1/>";
}
?>